// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵); 2, 4 -> 16

int GetNumbers(){
    Console.WriteLine("Введите два числа");
    int A = Convert.ToInt32(Console.ReadLine());
    Console.WriteLine();
    int B = Convert.ToInt32(Console.ReadLine());
    return A;
    return B;
}